	#Подготовка
create table if not exists staff(
		id int primary key not null unique,
    firstname varchar(45),
    lastname varchar(45),
    post varchar(45),
    seniority int,
    salary int,
    age int
);
    
insert into staff (id, firstname, lastname, post, seniority, salary, age) values 
	(1, "Вася", "Петров", "Начальник", 40, 100000, 60),
	(2, "Петр", "Власов", "Начальник", 8, 70000, 30),
	(3, "Катя", "Катина", "Инженер", 2, 70000, 25),
	(4, "Саша", "Сасин", "Инженер", 12, 50000, 35),
	(5, "Иван", "Иванов", "Рабочий", 40, 30000, 59),
	(6, "Петр", "Петров", "Рабочий", 20, 25000, 40),
	(7, "Сидр", "Сидоров", "Рабочий", 10, 20000, 35),
	(8, "Антон", "Антонов", "Рабочий", 8, 19000, 28),
	(9, "Юрий", "Юрков", "Рабочий", 5, 15000, 25),
	(10, "Максим", "Максимов", "Рабочий", 2, 11000, 22),
	(11, "Юрий", "Галкин", "Рабочий", 3, 12000, 24),
	(12, "Людмила", "Маркина", "Уборщик", 10, 10000, 49);

